Tekla Open API Reference for Tekla Structures 2025
AABB Properties
The AABB type exposes the following members.
Properties
Name | Description
MaxPoint
 The maximum point of the axis-aligned 3d bounding box.
MinPoint
 The minimum point of the axis-aligned 3d bounding box.
Top
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace